# import excel file

https://www.youtube.com/watch?v=hT4b9vFZRB0

In [2]:
import pandas as pd

In [3]:
pd.read_excel('pandas.xlsx')

  Unnamed: 0     City Country  Math  Science
0       John   Mumbai   India    42        6
1      Alice   London      UK    13       77
2        Bob   London      UK    43       59
3       Mary  Florida     USA    26       49
4      Krish   Madrid   Spain    82       58

Now we can search through data using the names of students

In [4]:
pd.read_excel('pandas.xlsx',index_col=0)

          City Country  Math  Science
John    Mumbai   India    42        6
Alice   London      UK    13       77
Bob     London      UK    43       59
Mary   Florida     USA    26       49
Krish   Madrid   Spain    82       58

Tells the row number where header\labels are

In [5]:
pd.read_excel('pandas.xlsx',index_col=0,header=0)

          City Country  Math  Science
John    Mumbai   India    42        6
Alice   London      UK    13       77
Bob     London      UK    43       59
Mary   Florida     USA    26       49
Krish   Madrid   Spain    82       58

Read only the A to C columns in the sheet

In [6]:
pd.read_excel('pandas.xlsx',index_col=0,header=0,usecols="A:C")

          City Country
John    Mumbai   India
Alice   London      UK
Bob     London      UK
Mary   Florida     USA
Krish   Madrid   Spain

Give custom names to the extracted columns

(You can see here that the index column is printed differently)

In [7]:
pd.read_excel('pandas.xlsx',index_col=0,header=0,names=["Name","City","Country","Math","Science"])

          City Country  Math  Science
Name
John    Mumbai   India    42        6
Alice   London      UK    13       77
Bob     London      UK    43       59
Mary   Florida     USA    26       49
Krish   Madrid   Spain    82       58

read only certain columns in excel file based on column number

In [8]:
pd.read_excel('pandas.xlsx',index_col=0,header=0,usecols=[0,2,4])

      Country  Science
John    India        6
Alice      UK       77
Bob        UK       59
Mary      USA       49
Krish   Spain       58

Read a particular sheet in the workbook using sheet number

In [9]:
pd.read_excel('pandas.xlsx',index_col=0,header=0,sheet_name=1)

             City    Country Degree Specialization
Manish     Mumbai      India    MSC          Maths
Chowdary    Delhi      India     BA        Physics
Chow        Perth  Australia    PHD          Maths
David     Colombo   Srilanka    BBM       Pharmacy
Samuel    Newyork        USA    BSC       Medicine

Read a particular sheet in the workbook using sheet name

In [10]:
pd.read_excel('pandas.xlsx',index_col=0,header=0,sheet_name="teacher") # Read a particular sheet in the workbook

             City    Country Degree Specialization
Manish     Mumbai      India    MSC          Maths
Chowdary    Delhi      India     BA        Physics
Chow        Perth  Australia    PHD          Maths
David     Colombo   Srilanka    BBM       Pharmacy
Samuel    Newyork        USA    BSC       Medicine

Skip certain rows

(The headers are all wrong here)

In [11]:
pd.read_excel('pandas.xlsx',index_col=0,header=0,sheet_name="teacher",skiprows=[0,1])

            Delhi      India   BA   Physics
Chowdary
Chow        Perth  Australia  PHD     Maths
David     Colombo   Srilanka  BBM  Pharmacy
Samuel    Newyork        USA  BSC  Medicine

Fix the header by giving custom header/labels

In [12]:
pd.read_excel('pandas.xlsx',index_col=0,header=0,sheet_name="teacher",skiprows=[0,1],names=["Name","City","Country","Degree","Specialization"])

           City    Country Degree Specialization
Name
Chow      Perth  Australia    PHD          Maths
David   Colombo   Srilanka    BBM       Pharmacy
Samuel  Newyork        USA    BSC       Medicine

In [13]:
teacher = pd.read_excel('pandas.xlsx',index_col=0,header=0,sheet_name="teacher")

In [14]:
teacher

             City    Country Degree Specialization
Manish     Mumbai      India    MSC          Maths
Chowdary    Delhi      India     BA        Physics
Chow        Perth  Australia    PHD          Maths
David     Colombo   Srilanka    BBM       Pharmacy
Samuel    Newyork        USA    BSC       Medicine

In [15]:
teacher.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Manish to Samuel
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   City            5 non-null      object
 1   Country         5 non-null      object
 2   Degree          5 non-null      object
 3   Specialization  5 non-null      object
dtypes: object(4)
memory usage: 100.0+ bytes

In [16]:
teacher.head(2)

            City Country Degree Specialization
Manish    Mumbai   India    MSC          Maths
Chowdary   Delhi   India     BA        Physics

In [17]:
#teacher.to_csv("teacher.csv")

# Video 2

https://www.youtube.com/watch?v=6whF-Vzuots

https://www.youtube.com/watch?v=wjPgszCLdYY

In [18]:
student=pd.read_excel('pandas.xlsx',sheet_name="student",index_col=0,header=0,names=["Name","City","Country","Math","Science"])

In [19]:
student

          City Country  Math  Science
Name
John    Mumbai   India    42        6
Alice   London      UK    13       77
Bob     London      UK    43       59
Mary   Florida     USA    26       49
Krish   Madrid   Spain    82       58

Give number of rows to be read from excel file

In [20]:
pd.read_excel('pandas.xlsx',sheet_name="student",index_col=0,header=0,nrows=2)

         City Country  Math  Science
John   Mumbai   India    42        6
Alice  London      UK    13       77

Using loc and iloc commands

In [21]:
student.iloc[[0,2,4]]
# iloc is index locator for integer index
# iloc = [0,1] for 0th index 1st index i.e. 0 and 1 row numbers
# loc is for locating non-integer index
# loc=['index1','index2'] where index1, index2 are names of the index of row

         City Country  Math  Science
Name
John   Mumbai   India    42        6
Bob    London      UK    43       59
Krish  Madrid   Spain    82       58

In [22]:
student.loc[['Alice','Krish']]

         City Country  Math  Science
Name
Alice  London      UK    13       77
Krish  Madrid   Spain    82       58

In [23]:
student.iloc[0]

City       Mumbai
Country     India
Math           42
Science         6
Name: John, dtype: object

In [24]:
student.iloc[0,1] # To get a particular attribute of an index (if the index is an integer)
# 0 is the row number
# 1 is the column number

'India'

In [25]:
student.loc['Alice','City'] # To get a particular attribute of an index (if the index is a non-integer)

'London'

index slicing for getting the boolean table based on condition

In [26]:
student.iloc[:,2]>30 # generates a true and false table

Name
John      True
Alice    False
Bob       True
Mary     False
Krish     True
Name: Math, dtype: bool

dataframe [Boolean list] will return only the rows which are true

In [28]:
student[student.iloc[:,2]>30]    # Getting the rows based on condition
# student[Boolean list] will returns only the rows which are true

         City Country  Math  Science
Name
John   Mumbai   India    42        6
Bob    London      UK    43       59
Krish  Madrid   Spain    82       58

In [29]:
student[~(student.iloc[:,2]>30)] 
# Using not condition in pandas, here we get students whose math marks are not greater than 30

          City Country  Math  Science
Name
Alice   London      UK    13       77
Mary   Florida     USA    26       49

list a particular column of the entire dataframe

In [51]:
student['Country']

Name
John     India
Alice       UK
Bob         UK
Mary       USA
Krish    Spain
Name: Country, dtype: object

finding indices whose particular entries are present in another list

(generates a boolean table)

In [50]:
student['Country'].isin(['UK','USA'])

Name
John     False
Alice     True
Bob       True
Mary      True
Krish    False
Name: Country, dtype: bool

In [32]:
student[student['Country'].isin(['UK','USA'])] # returns the rows for which the condition is true

          City Country  Math  Science
Name
Alice   London      UK    13       77
Bob     London      UK    43       59
Mary   Florida     USA    26       49

In [33]:
student[~student['Country'].isin(['UK','USA'])]

         City Country  Math  Science
Name
John   Mumbai   India    42        6
Krish  Madrid   Spain    82       58

choosing only certain column values of the returned conditioned rows

In [34]:
student[~student['Country'].isin(['UK','USA'])]['Country']

Name
John     India
Krish    Spain
Name: Country, dtype: object

In [35]:
student[student['Country'].str.startswith('U')] # check based on starting letter of a string

          City Country  Math  Science
Name
Alice   London      UK    13       77
Bob     London      UK    43       59
Mary   Florida     USA    26       49

choosing only index values of the returned conditioned rows

In [36]:
student[student['Country'].str.startswith('U')].index

Index(['Alice', 'Bob', 'Mary'], dtype='object', name='Name')

Adding a new column

In [37]:
student['Notes'] = None 
Ustart=student[student['Country'].str.startswith('U')].index
student['Notes'][Ustart]="Starting with U"
student

<ipython-input-37-286b5face0a0>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  student['Notes'][Ustart]="Starting with U"

          City Country  Math  Science            Notes
Name
John    Mumbai   India    42        6             None
Alice   London      UK    13       77  Starting with U
Bob     London      UK    43       59  Starting with U
Mary   Florida     USA    26       49  Starting with U
Krish   Madrid   Spain    82       58             None

In [38]:
student.index.values # returns an array of index

array(['John', 'Alice', 'Bob', 'Mary', 'Krish'], dtype=object)

For removing NaN in the dataframes

In [39]:
d=student.isna()
student=student.mask(d,0) # replaces NaN with zeros
student

          City Country  Math  Science            Notes
Name
John    Mumbai   India    42        6                0
Alice   London      UK    13       77  Starting with U
Bob     London      UK    43       59  Starting with U
Mary   Florida     USA    26       49  Starting with U
Krish   Madrid   Spain    82       58                0

In [40]:
[student['Notes']==0]

[Name
 John      True
 Alice    False
 Bob      False
 Mary     False
 Krish     True
 Name: Notes, dtype: bool]

first method of choosing columns, using column names

In [53]:
student[['City','Math']]

          City  Math
Name
John    Mumbai    42
Alice   London    13
Bob     London    43
Mary   Florida    26
Krish   Madrid    82

In [54]:
student.columns

Index(['City', 'Country', 'Math', 'Science', 'Notes'], dtype='object')

Second method of choosing columns, using list of column names

In [58]:
student[student.columns[[0,2]]]

          City  Math
Name
John    Mumbai    42
Alice   London    13
Bob     London    43
Mary   Florida    26
Krish   Madrid    82

Third method of choosing columns, using column names

In [59]:
student.loc[:,['City','Math']]

          City  Math
Name
John    Mumbai    42
Alice   London    13
Bob     London    43
Mary   Florida    26
Krish   Madrid    82

Fourth method of choosing range of columns, using column names

In [61]:
student.loc[:,'City':'Science']

          City Country  Math  Science
Name
John    Mumbai   India    42        6
Alice   London      UK    13       77
Bob     London      UK    43       59
Mary   Florida     USA    26       49
Krish   Madrid   Spain    82       58

Fifth method of choosing range of columns using column numbers

In [63]:
student.iloc[:,0:2]

          City Country
Name
John    Mumbai   India
Alice   London      UK
Bob     London      UK
Mary   Florida     USA
Krish   Madrid   Spain

Sixth method of choosing columns using column numbers

In [68]:
student.iloc[:,[0,2,3]]

          City  Math  Science
Name
John    Mumbai    42        6
Alice   London    13       77
Bob     London    43       59
Mary   Florida    26       49
Krish   Madrid    82       58

Seventh method of choosing columns row by column numbers

In [ ]:
# dataFrame.loc[<ROWS RANGE> , <COLUMNS RANGE>]
columnsData = student.loc[ : , 'Math' ]

reset column numbers and index numbers of a dataframe

In [42]:
# d4=(~(d1[reqCols]==0)).any()  
# d4=d4.reset_index(drop=True)  # resets the index number
# d4.columns=range(d4.shape[0]) # resets the column numbers

generate empty dataframe

In [3]:
df=pd.DataFrame(columns=['S.No','Value1','Value2'],index=['one','two','three'])
df

      S.No Value1 Value2
one    NaN    NaN    NaN
two    NaN    NaN    NaN
three  NaN    NaN    NaN

concatinate two dataframes

In [5]:
df2=pd.DataFrame(columns=['S.No','Value1','Value2'],index=['four','five','six'])
df=pd.concat([df,df2])
df

      S.No Value1 Value2
one    NaN    NaN    NaN
two    NaN    NaN    NaN
three  NaN    NaN    NaN
four   NaN    NaN    NaN
five   NaN    NaN    NaN
six    NaN    NaN    NaN

In [43]:
# df1.head(3)
# df2.tail(3)
# df2.columns
# df1.iloc[1:3]   # Read each row
# df2.iloc[0:2]
# df2.iloc[0,2] # Read a specific location (R,C)

# for index,row in df2.iterrows():  # Iteration over rows in dataframe
#     print(index,row)
#     print(index,row[0])
#     print(row[0])

# df2.loc[df2[1]=="up"]  # loc is for non integer lookup on entire column 1

# df2.describe()
# df2.sort_values([0]) # 0 is the column number
# df2.sort_values([0],ascending=False)
# df2.sort_values([0,1],ascending=[1,0]) # 0 column is ascending, 1 column in descending

# df2['Total'] = df.iloc[:,4:11].sum(axis=1)               # Adding a column 'Total' whose value is sum of integers in all rows and columns 4 to 10 (iloc[:,4:11])
# df2 = df2.drop(columns=['Total'])                        # Axis=1 implies horizontally


# Writing to a file

# df2.to_csv('modified.csv',index=False)
# df2.to_excel('modified.xlsx',index=False)
# df2.to_csv('modified.txt', index=False, sep='\t')

# Filtering data
# newdf = df2.loc[(df2[1]=="up") & (df2[0]==801) & (df2[4]>=0.8)]
# newdf = newdf.reset_index(drop=True) # drops the old indices
# df2.loc[df2[1].str.contains("up")]  # not is by ~

# Changing data
# df2.loc[df[0]=="914","Halt"] = True # changes the Halt column of 914 train to True

In [ ]:
import pandas as pd
import numpy as np

df = pd.read_csv('loopfiles.txt',sep=' ')

dft=pd.read_excel('Delhi_Mumbai_TimeTable.xlsx',sheet_name='Train Schedule',index_col=0,usecols=[2,5,6,22,23])
dft

dft.loc[618]

dftemp1=dft.loc[290].iloc[0]

for i in range(1,dft.loc[290].shape[0]):
    dftemp1=pd.concat([dftemp1,dft.loc[290].iloc[i,[1,2,3]]],axis=0,join='outer',sort=False)

dftemp1

dftemp2=dft.loc[618].iloc[0]

for i in range(1,dft.loc[618].shape[0]):
    dftemp2=pd.concat([dftemp2,dft.loc[618].iloc[i,[1,2,3]]],axis=0,join='outer')

dftemp2

pd.concat([dftemp1,dftemp2])

https://www.geeksforgeeks.org/python-pandas-dataframe-set_index/

https://kite.com/python/answers/how-to-convert-a-list-of-lists-into-a-pandas-dataframe-in-python

https://www.geeksforgeeks.org/indexing-and-selecting-data-with-pandas/

In [ ]:
# list(df5.loc['290'][sttn][df5.loc['290'][sttn].isin(df3.loc[290][sttn])].index)